# Basic Steps for Configuring a Router

Las tareas a realizar para llevar a cabo la configuración inicial de un Router son:

- Configuración del nombre del dispositivo:
```cmd
Router(config)# hostname {hostname}
```

- Proteger el modo EXEC de privilegio con credenciales:
```cmd
Router(config)# enable secret {password}
```

- Proteger el modo EXEC de usuario con credenciales:
```cmd
Router(config)# line console 0
Router(config-line)# password {password}
Router(config-line)# login
```

- Proteger el acceso remoto por Telnet y SSH:
```cmd
Router(config-line)# line vty 0 4
Router(config-line)# password {password}
Router(config-line)# login
Router(config-line)# trasnport input {ssh | telnet}
```

- Proteger todas las contraseñas del archivo de configuración:
```cmd
Router(config-line)# exit
Router(config)# service password-encryption
```

- Proporcionar una notificación legal:
```cmd
Router(config)# banner motd #Authorized personal access only!#
```

----
# Routers Basic Configuration EXAMPLE

En este ejemplo, el router R1 del diagrama de topología se configurará con la configuración inicial: 

![[Pasted image 20241025143849.png]]

Para configurar el nombre del dispositivo para R1, utilizariamos los siguientes comandos:

```cmd
Router> enable
Router# configure terminal
Router(config)# hostname R1
R1(config)# exit
```

Todo el acceso al router debe estar asegurado. El modo EXEC pribilegiado porporciona al usuario acceso completo al dispositivo y su configuración. Por lo tanto, es el modo más importante para asegurar. 

Los sigueintes comandos aseguraran el modo EXEC privilegiado y de usario, habilitará el acceso remoto Telnet y SSH mediante credenciales y cifrará todas als contraseñas de texto sin formato. (Como se puede ver en detalle en [[0. Setting the Initial Router Parameters]]):

```cmd
R1# configure terminal
R1(config)# enable secret {password}
R1(config)# line console 0
R1(config-line)# password {password}
R1(config-line)# login
R1(config-line)# exit
R1(config)# line vty 0 4
R1(config-line)# password {password}
R1(config-line)# login
R1(config-line)# transport input ssh telnet
R1(config-line)# exit
R1(config)# service password-encryption
R1(config)#
```

Como sabemos, la notificación legal advierte a los usuarios que solo deben acceder al dispoisitivo los usuarios permitidos. La notificación legan se configurará de la sigueinte manera:

```cmd
R1(config)# banner motd #
*************************************************
WARNING: Unauthorized access is prohibited! Go away!
*************************************************
# 
R1(config)#
```

Si se configuraron los comandos anteriores y el router perdió energía accidentalmente, se perderían todos los comandos configurados. Por esta razón, es imporatnte gruardar la configuración cuando se implementen los cambios. Los sigueintes comandos guardarán la configuración actual ubiacada en la RAM en la memoria ROM para volver a está la configuración guardada.

```cmd
R1# copy running-config startup-config
